{"inkVersion":20,"root":[["\n",{"->":"intro"},["done",{"#n":"g-0"}],null],"done",{"intro":[[{"#":"CLEAR"},{"#":"HEADER: img/profile.jpg"},{"#":"HR: simple"},"^<b><i><center>By understanding who we are, we can decide what requires our attention</center></i></b>","\n",{"#":"HR: simple"},"^Hi, I'm Mara!  I'm a 3rd year PhD student working with <a href=\"https:faculty.washington.edu/ajko/\">Amy J. Ko</a>.","\n","^Presently, my research interests are centered around career decisions made by students in computing, and what factors inform those decisions.","\n","^I'm most interested in career decisions made by computing students, or, why so many graduates from prestigious CS programs go to work at one of four companies. I promise, it's not just the money.","\n","^I hope that one day, more computing learners can find work that affirms their personhood, honors their narratives, and brings about collective liberation. Or, at least makes them happy -- lots of folks seem pretty unhappy.","\n","^I'm also working on integrating critical pedagogy into computer systems courses, surfacing students understandings of <i>how we got here</i>, instead of solely explaining how computer systems work.","\n","^I've dubbed myself a \"recovering computer architect\", I researched manycore compiler solutions with <a href=\"http:michaeltaylor.org/\">Micheal Taylor</a> and intermittent FPGAs and multithreading support with <a href=\"https:brandonlucia.com/\">Brandon Lucia</a>, before switching to computing education.","\n","^I get excited about a whole bunch of things: metacognition, queer theory, surveillance capitalism, political identity, the role of computing in society, and problem selection.","\n",{"#":"I'm working to change the narrative around computing (currently vying for the most ubiquitous trade) from \"something that software engineers do when they move fast and break things\" to \"a tool that can create profound societal change and must be used as a force for liberation\"."},"ev","str","^Publications","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"pubs"},{"#":"+ [Take a breath!]"},{"#":"-> breathe.prep"},null]}],null],"breathe":[{"->":".^.prep"},{"prep":[[{"#":"CLEAR"},"^We're just going to take a few breaths.","\n","^It's helpful to slow down a bit before introspection.","\n","^You can close your eyes if you'd like.","\n","^Ready?","\n","ev","str","^yup!","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"breathe.breath"},null]}],null],"breath":[{"#":"CLEAR"},"^Breathe in...      ",{"#":"DELAY: 4000"},"\n","^...and breathe out ",{"#":"DELAY: 4000"},"\n","^Breathe in...      ",{"#":"DELAY: 5000"},"\n","^...and breathe out ",{"#":"DELAY: 5000"},"\n","^Breathe in...      ",{"#":"DELAY: 5000"},"\n","^...and breathe out ",{"#":"DELAY: 5000"},"\n","ev",{"CNT?":".^.^.breath_suffix"},"!","out","/ev","^ ",{"->":".^.^.breath_suffix"},"\n","ev",{"CNT?":".^.^.breath_suffix"},"out","/ev","^ ",{"->":".^.^.choices"},"\n",null],"breath_suffix":["^You can continue at whatever pace feels good for you.","\n","^There's no need to rush through this.","\n","^Feel free to continue whenever you're ready.","\n",{"->":".^.^.choices"},{"#f":1}],"choices":[["ev","str","^I'd like a few more guided breaths","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^I'd like to continue on","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"breathe.breath"},null],"c-1":["\n",{"->":"intro"},null]}],null]}],"pubs":[[{"#":"CLEAR"},"^I haven't published much, but stay tuned!","\n","^<a href=\"papers/CACMcriticalcs2020.pdf\">It's time for more Critical CS Education</a>.  Amy J. Ko, Alannah Oleson, <b>Mara Kirdani-Ryan</b>, Yim Register, Benjamin Xie, Mina Tari, Matthew Davidson, Stefania Druga, and Dastyni Loksa. <i>Communications of the ACM</i>, 31–33. November 2020.","\n","ev","str","^Go back","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"intro"},null]}],null],"ending":["^You've reached the end! Thanks!","\n","end",null],"identity":[{"->":".^.start"},{"start":[[{"#":"CLEAR"},{"#":"HR: simple"},"^<b><i><center>Identity: A Coming out in Seven Parts</center></i></b>","\n",{"#":"HR: simple"},"^For most of my life, I haven't really had a sense of who I am.","\n","^Identity's a fairly complicated business for better or worse, and, try as I","\n","^Once I started,","\n","^Yes, I've come out 7 times. I know, it's excessive.","\n","^The lovely Natalie Wynn, of Contrapoints said that, after coming out three times, you're just asking for attention, I don't know where 7 leaves me. Begging desparately for attention?","\n","^There's the usual bits: gender and sexuality, but I've felt like I've come out every time that I've figured out some piece of myself that feels consistent, that feels like me, in this moment.","\n","^After I've found some new piece, I'll keep it to myself for a little while, but, after having lived without a sense of self for so long, I struggle with silence.","\n","^Soon after, I'll feel like I'm being suffocated by having to keep some part of","\n","^Every time I share some piece of myself and I'm not entirely sure how anyone will react, I feel like I'm coming-out all over again.","\n","^It gets easier, for sure, but, as I've realized through dozens of hours of name-change work, sometimes it doesn't.","\n","ev","str","^Summer 2017","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"identity.queer"},null]}],null],"queer":[["^I'll be honest, this one wasn't terribly complicated. My mom fell in love with a woman when I was 9, and at that point, I was young enough, and in a progressive enough bubble, that I didn't really think twice about it.","\n","^Dear reader, if we're being entirely honest, I was a consistently awkward child, so I thought that I could use my mom as an in, among whoever seemed coolest in the elementary school pecking order.","\n","^Naturally, this wasn't the most coherent plan, and I think the most mileage that I ever got out of my mom's sexuality (a bizzare clause, but bear with me), was some friend of a friend telling me that my mom was hot a year later. Kids are strange beasts, no question.","\n","^In the summer of 2017, I had entirely no idea what to do with my life and ended up interning at Apple, for no apparant reason other than 1) a friend of mine was starting full-time, and 2) they seemed the most prestigous out of the companies that gave me offers.","\n","^Why not center prestige, right?","\n","^I was living in San Francisco, recently single, stumbling constantly, full of wanting to be seen, to have","\n","ev","str","^Fall 2017","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"identity.poly"},null]}],null],"poly":[[{"#":"Valentine's day massacre"},{"#":"Switching to using \"partner\", because \"boyfriend\" felt weird."},{"#":"Dating multiple people without any clear idea what I was doing"},{"#":"For me, having multiple partners and treating each of them as I would a monogohous relationship meant watching (with some delight) all my free time for reflection and introspection disappear."},{"#":"I don't know if I'd recommend it, to be perfectly honest."},{"#":""},{"#":"This fits nicely into existing trans narratives, but, honestly, there were more than a few things that I was avoiding."},"ev","str","^Fall 2019","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"identity.autistic"},null]}],null],"autistic":[["^I have the privledge of having two doctor-parents, so, dear reader, you'd figure that we could've worked this one out much, much sooner. Alas and alak, a lifetime of waiting.","\n","^I grew up in the late 1990s, under a definiton of autism within the medical community that hinged heavily upon one's ability to communicate with others. Autism, and neurodiversity broadly, were binary defintions: if you could communicate with neurotypical people without apparant struggle, there wasn't any need to provide a diagnosis. Those deeply intertwined within medical research were beginning to delineate between different degrees of neurodivesity, leaving still-harmful labels like \"low-functioning\" (i.e. not deserving of agency) and \"high-functioning\" (i.e. not deserving of support) behind for the public to apply haphazardly.","\n","^I don't know if I regret not knowing sooner. I've certianly thought about it, especially through the ways that my brain interacts with my gender identity, but I don't know what I would've done with a label that likely would've just ended up distancing me from other kids. Most of the times that I've felt particularly suicidal, I've felt incredibly alone, desparate for care, masking my neurodiversity and depression alike.","\n","^Often, I've tried to engage with others reflectively, hoping that providing enough care and space would mean that I'd be able to get something back. I've learned that this is a bargin that doesn't have clear notions of consent attached to it.","\n",{"#":"My identity has to be consistent, I can't just fragment myself and I'm so grateful for that"},{"#":"TODO: Add when I lost my neurotypical card to yim, \"no longer someone that I would recieve advice from"},"ev","str","^Winter 2020","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"identity.nonbinary"},null]}],null],"nonbinary":[["^At this point I could maybe still say that I was asking for attention","\n","ev","str","^Summer 2020","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"identity.trans"},null]}],null],"trans":[["^For me, being trans is a little scary. If non-binary is the cool, casual rejection of rules and conventions in service of self-actualizaiton, being trans is aligning with the collective struggle of everyone that started their lives not fitting. At least, I think of it that way. I won't pretend to be an authority.","\n","^There's a realness to being trans. Being trans meant acknowledging that I was in pain, that the pain I was feeling was dysphoria, and that there weren't any easy ways of escaping that.","\n",{"#":"TODO: Add the trans quote from my startify!!"},"^Being trans acknowledges the lie of a continuous, static self.","\n","ev","str","^Winter 2021","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"identity.hrt"},null]}],null],"hrt":[["^And yet, even after coming out so many times, I still found myself in pain.","\n","^There's a hysteresis effect with myself that I've notice; the aches always end up leading somewhere, and I mostly know where, but there's this space of sitting in ache.","\n","^I've come to call it \"non-binary nausea\": a debilitating swirling between very few rules and a heap of biting, gendered expectations.","\n",{"#":"TODO: I wish I had known sooner, there's a whole bunch of people that I hurt along the path towards figuring all of this out."},{"#":"TODO: How I usually tell it; I thought I'd be dead before 30, I found myself looking towards the future, suprising myself."},"ev","str","^Spring 2021","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"identity.mara"},null]}],null],"mara":[["^This one I saw coming, but I wasn't sure what form it might take.","\n","^Coming up with names is an oddly tiring business, especially for the perpetually indecisive.","\n","^Those astrologically inclined will note strong water signs, but I don't know, I just get overwhelmed with options pretty easily.","\n","^At this point, my old name wasn't mine anymore, the me-but-not-me so common in trans experiences.","\n","ev","str","^Now","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"identity.conclude"},null]}],null],"conclude":["end",null]}]}],"listDefs":{}}